Revit 2027 API
Document.NewRooms2(Level) Method
 Creates new rooms in each plan circuit found in the given level in the last phase.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> NewRooms2(
	Level level
)
Public Function NewRooms2 (
	level As Level
) As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ NewRooms2(
	Level^ level
)
member NewRooms2 :
        level : Level -> ICollection<ElementId>
Parameters
level Level
 The level from which the circuits are found.
Return Value
ICollection<ElementId>
 If successful, a set of ElementIds which contains the rooms created should be returned, otherwise null.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  If the view of the relevant level can not be retrieved.
InvalidOperationException | If the phase is invalid, or regeneration fails at the end of the creation.
ArgumentException | Thrown if the level does not exist in the given document.
See Also
Reference
Document Class
NewRooms2 Overload
Autodesk.Revit.Creation Namespace